ruuvi/ruuvitracker_fw/src/platform/stm32f4/gsm.c
/*
 *  Simcom 908 GSM Driver for Ruuvitracker.
 *
 * @author: Seppo Takalo
 */


#include "platform.h"
#include "platform_conf.h"
#include "common.h"
#include "lua.h"
#include "lualib.h"
#include "lauxlib.h"
#include "platform.h"
#include "lrotable.h"
#include "stm32f4xx.h"
#include "stm32f4xx_conf.h"
#include "gsm.h"
#include <delay.h>
#include <string.h>
#include <stdlib.h>
#include <slre.h>

#ifdef BUILD_GSM

// For plaform_pio_op() portnums
#define PORT_A 0
#define PORT_B 1
#define PORT_C 2
#define PORT_D 3
#define PORT_E 4

#define STATUS_PIN GPIO_Pin_12
#define STATUS_PORT PORT_E
#define DTR_PIN    GPIO_Pin_14
#define DTR_PORT   PORT_C
#define POWER_PIN  GPIO_Pin_2
#define POWER_PORT PORT_E
#define ENABLE_PIN  GPIO_Pin_15
#define ENABLE_PORT PORT_C

#define BUFF_SIZE	64

#define GSM_CMD_LINE_END "\r\n"

#define TIMEOUT_MS   5000        /* Default timeout 5s */
#define TIMEOUT_HTTP 15000      /* Http timeout, 15s */

enum State {
  STATE_UNKNOWN = 0,
  STATE_OFF = 1,
  STATE_BOOTING,
  STATE_ASK_PIN,
  STATE_WAIT_NETWORK,
  STATE_READY,
  STATE_ERROR,
};
enum CFUN {
  CFUN_0 = 0,
  CFUN_1 = 1,
};
enum GSM_FLAGS {
  HW_FLOW_ENABLED = 0x01,
  SIM_INSERTED    = 0x02,
  GPS_READY       = 0x04,
  GPRS_READY      = 0x08,
  CALL            = 0x10,
  INCOMING_CALL   = 0x20,
  TCP_ENABLED     = 0x40,
};

/* Modem Status */
struct gsm_modem {
  enum Power_mode power_mode;
  enum State state;
  volatile int waiting_reply;
  volatile int raw_mode;
  enum Reply reply;
  int flags;
  enum CFUN cfun;
  int last_sms_index;
  char ap_name[64];
} static gsm = {		/* Initial status */
  .power_mode=POWER_OFF,
  .state = STATE_OFF,
};


/* Handler functions for AT replies*/
static void handle_ok(char *line);
static void handle_fail(char *line);
static void handle_error(char *line);
static void set_hw_flow();
static void parse_cfun(char *line);
static void gpsready(char *line);
static void sim_inserted(char *line);
static void no_sim(char *line);
static void incoming_call(char *line);
static void call_ended(char *line);
static void parse_network(char *line);
static void parse_sapbr(char *line);
static void parse_sms_in(char *line);
static void socket_receive(char *line);

typedef struct Message Message;
struct Message {
  char *msg;			/* Message string */
  enum State next_state;	/* Atomatic state transition */
  void (*func)();		/* Function to call on message */
};

/* Messages from modem */
static Message urc_messages[] = {
  /* Unsolicited Result Codes (URC messages) */
  { "RDY",                  .next_state=STATE_BOOTING },
  { "+CPIN: NOT INSERTED",  .next_state=STATE_ERROR, .func = no_sim },
  { "+CPIN: READY",         .next_state=STATE_WAIT_NETWORK, .func = sim_inserted },
  { "+CPIN: SIM PIN",       .next_state=STATE_ASK_PIN, .func = sim_inserted },
  { "+CFUN:",               .func = parse_cfun },
  { "Call Ready",           .next_state=STATE_READY },
  { "GPS Ready",            .func = gpsready },
  { "NORMAL POWER DOWN",    .next_state=STATE_OFF },
  { "+COPS:",               .func = parse_network },
  { "+SAPBR:",              .func = parse_sapbr },
  { "+PDP: DEACT", }, //TODO
  { "+RECEIVE",             .func = socket_receive },
  /* Return codes */
  { "OK",   .func = handle_ok },
  { "FAIL", .func = handle_fail },
  { "ERROR",.func = handle_error },
  { "+CME ERROR", .func = handle_error },
  { "+CMS ERROR" },                       /* TODO: handle */
  /* During Call */
  { "NO CARRIER",   .func = call_ended }, /* This is general end-of-call */
  { "NO DIALTONE",  .func = call_ended },
  { "BUSY",         .func = handle_fail },
  { "NO ANSWER",    .func = handle_fail },
  { "RING",         .func = incoming_call },
  /* SMS */
  { "+CMTI:",       .func = parse_sms_in },
  { NULL } /* Table must end with NULL */
};

/* Some interrupt helpers */
int gsm_int_dummy_set_status( elua_int_resnum resnum, int state ) { return 0; }
int gsm_int_dummy_get_status( elua_int_resnum resnum ) { return ENABLE; }

int gsm_int_call_get_flag  ( elua_int_resnum resnum, int clear )
{
  return (gsm.flags&INCOMING_CALL)!=0;
}

int gsm_int_sms_get_flag  ( elua_int_resnum resnum, int clear )
{
//TODO: implement
  return 0;
}

static void incoming_call(char *line)
{
  gsm.flags |= INCOMING_CALL;
  cmn_int_handler( INT_GSM_CALL, 0 );
}

static void call_ended(char *line)
{
  gsm.flags &= ~CALL;
  gsm.flags &= ~INCOMING_CALL;
}

static void parse_sms_in(char *line)
{
  if (1 == sscanf(line, "+CMTI: \"SM\",%d", &gsm.last_sms_index)) {
    cmn_int_handler( INT_GSM_SMS, gsm.last_sms_index);
  }
}

static void parse_network(char *line)
{
  char network[64];
  /* Example: +COPS: 0,0,"Saunalahti" */
  if (1 == sscanf(line, "+COPS: 0,0,\"%s", network)) {
    *strchr(network,'"') = 0;
    printf("GSM: Registered to network %s\n", network);
    gsm.state = STATE_READY;
  }
}

#define STATUS_CONNECTING 0
#define STATUS_CONNECTED 1
static const char sapbr_deact[] = "+SAPBR 1: DEACT";

static void parse_sapbr(char *line)
{
  int status;

  /* Example: +SAPBR: 1,1,"10.172.79.111"
   * 1=Profile number
   * 1=connected, 0=connecting, 3,4 =closing/closed
   * ".." = ip addr
   */
  if (1 == sscanf(line, "+SAPBR: %*d,%d", &status)) {
    switch(status) {
    case STATUS_CONNECTING:
    case STATUS_CONNECTED:
      gsm.flags |= GPRS_READY;
      break;
    default:
      gsm.flags &= ~GPRS_READY;
    }
  } else if (0 == strncmp(line, sapbr_deact, strlen(sapbr_deact))) {
    gsm.flags &= ~GPRS_READY;
  }
}

static void sim_inserted(char *line)
{
  gsm.flags |= SIM_INSERTED;
}

static void no_sim(char *line)
{
  gsm.flags &= ~SIM_INSERTED;
}

static void gpsready(char *line)
{
  gsm.flags |= GPS_READY;
}

static void parse_cfun(char *line)
{
  if (strchr(line,'0')) {
    gsm.cfun = CFUN_0;
  } else if (strchr(line,'1')) {
    gsm.cfun = CFUN_1;
  } else {
    printf("GSM: Unknown CFUN state\n");
  }
}
static void handle_ok(char *line)
{
  gsm.reply = AT_OK;
  gsm.waiting_reply = 0;
}

static void handle_fail(char *line)
{
  gsm.reply = AT_FAIL;
  gsm.waiting_reply = 0;
}

static void handle_error(char *line)
{
  gsm.reply = AT_ERROR;
  gsm.waiting_reply = 0;
}


/**
 * Send AT command to modem.
 * Waits for modem to reply with 'OK', 'FAIL' or 'ERROR'
 * return AT_OK, AT_FAIL or AT_ERROR
 */
int gsm_cmd(const char *cmd)
{
  unsigned int t;

  /* Flush buffers */
  gsm_disable_raw_mode();
  while(-1 != platform_s_uart_recv(GSM_UART_ID, 0))
    ;;

