ruuvi/ruuvitracker_fw/src/platform/stm32f4/gsm.c
  t = systick_get_raw();                  /* Get System timer current value */
  t += TIMEOUT_MS*systick_get_hz()/1000;
  gsm.waiting_reply = 1;
  gsm_uart_write(cmd);
  gsm_uart_write(GSM_CMD_LINE_END);

  while(gsm.waiting_reply) {
    if (t < systick_get_raw()) {
      /* Timeout */
      gsm.waiting_reply = 0;
      return AT_TIMEOUT;
    }
    delay_ms(1);
  }

  return gsm.reply;
}

int gsm_cmd_check(const char *cmd)
{
  int rc;
  printf("GSM CMD: %s\n", cmd);
  rc = gsm_cmd(cmd);
  if (rc) {
    switch(rc) {
    case AT_TIMEOUT:
      printf("TIMEOUT\n");
      break;
    case AT_FAIL:
      printf("Failed\n");
      break;
    case AT_ERROR:
      printf("Returned error\n");
      break;
    }
  }
  return rc;
}
#define gsm_cmd gsm_cmd_check

int gsm_cmd_fmt(const char *fmt, ...)
{
  char cmd[256];
  va_list ap;
  va_start( ap, fmt );
  vsnprintf( cmd, 256, fmt, ap );
  va_end( ap );
  return gsm_cmd(cmd);
}

void gsm_set_raw_mode()
{
  gsm.raw_mode = 1;
}
void gsm_disable_raw_mode()
{
  gsm.raw_mode = 0;
}
int gsm_is_raw_mode()
{
  return gsm.raw_mode;
}

/* Wait for specific pattern, copy rest of line to buffer, if given*/
int gsm_wait(const char *pattern, int timeout, char *line)
{
  const char *p = pattern;
  int c, ret;
  int i;
  unsigned int t = systick_get_raw();
  t+=timeout*systick_get_hz()/1000;

  int was_raw_mode = gsm_is_raw_mode();
  gsm_set_raw_mode();

  ret = AT_OK;
  while(*p) {
    c = platform_s_uart_recv(GSM_UART_ID, 0);
    if (-1 == c) {
      if (t < systick_get_raw()) {
        ret = AT_TIMEOUT;
        goto WAIT_END;
      } else {
        delay_ms(1);
      }
      continue;
    }
    if (c == *p) { //Match
      p++;
    } else { //No match, go back to start
      p = pattern;
    }
  }

  if (line) {
       strcpy(line, pattern);
       i = strlen(line);
       while ('\n' != (c = platform_s_uart_recv(GSM_UART_ID, PLATFORM_TIMER_INF_TIMEOUT))) {
	    line[i++] = c;
       }
  }

WAIT_END:
  if (!was_raw_mode)
    gsm_disable_raw_mode();

  return ret;
}

int gsm_cmd_wait(const char *cmd, const char *response, int timeout)
{
  int r;
  gsm_set_raw_mode();
  gsm_uart_write(cmd);
  r = gsm_wait(response, timeout, NULL);
  gsm_disable_raw_mode();
  return r;
}
int gsm_cmd_wait_fmt(const char *response, int timeout, char *fmt, ...)
{
  char cmd[256];
  va_list ap;
  va_start( ap, fmt );
  vsnprintf( cmd, 256, fmt, ap );
  va_end( ap );
  return gsm_cmd_wait(cmd, response, timeout);
}

/* Read line from GSM serial port to buffer */
int gsm_read_line(char *buf, int max_len)
{
  int i,c;
  int was_raw = gsm_is_raw_mode();
  gsm_set_raw_mode();
  for(i=0;i<(max_len-1);i++) {
    c = platform_s_uart_recv(GSM_UART_ID, PLATFORM_TIMER_INF_TIMEOUT);
    buf[i] = (char)c;
    if ('\n' == c)
      break;
  }
  buf[++i]=0;
  if (!was_raw)
    gsm_disable_raw_mode();
  return i;
}

int gsm_read_raw(char *buf, int max_len)
{
  int i;
  int was_raw = gsm_is_raw_mode();
  gsm_set_raw_mode();
  for(i=0;i<max_len;i++) {
    buf[i] = platform_s_uart_recv(GSM_UART_ID, PLATFORM_TIMER_INF_TIMEOUT);
  }
  if (!was_raw)
    gsm_disable_raw_mode();
  return i;
}

/* Setup IO ports. Called in platform_setup() from platform.c */
void gsm_setup_io()
{
  /* Power pin (PE.2) */
  platform_pio_op(POWER_PORT, POWER_PIN, PLATFORM_IO_PIN_DIR_OUTPUT);
  platform_pio_op(POWER_PORT, POWER_PIN, PLATFORM_IO_PIN_SET);
  /* DTR pin (PC14) */
  platform_pio_op(DTR_PORT, DTR_PIN, PLATFORM_IO_PIN_DIR_OUTPUT);
  platform_pio_op(DTR_PORT, DTR_PIN, PLATFORM_IO_PIN_CLEAR);
  /* Status pin (PE12) */
  platform_pio_op(STATUS_PORT, STATUS_PIN, PLATFORM_IO_PIN_DIR_INPUT);
  /* Enable_voltage (PC15) */
  platform_pio_op(ENABLE_PORT, ENABLE_PIN, PLATFORM_IO_PIN_DIR_OUTPUT);
  platform_pio_op(ENABLE_PORT, ENABLE_PIN, PLATFORM_IO_PIN_CLEAR);

  // Serial port
  platform_uart_setup( GSM_UART_ID, 115200, 8, PLATFORM_UART_PARITY_NONE, PLATFORM_UART_STOPBITS_1);
  platform_s_uart_set_flow_control( GSM_UART_ID, PLATFORM_UART_FLOW_CTS | PLATFORM_UART_FLOW_RTS);
}

static void set_hw_flow()
{
  while(gsm.state < STATE_BOOTING)
    delay_ms(1);

  if (AT_OK == gsm_cmd("AT+IFC=2,2")) {
    gsm.flags |= HW_FLOW_ENABLED;
    gsm_cmd("ATE0"); 		/* Disable ECHO */
  }
}

void gsm_enable_voltage()
{
  platform_pio_op(ENABLE_PORT, ENABLE_PIN, PLATFORM_IO_PIN_CLEAR);
  delay_ms(100);		/* Give 100ms for voltage to settle */
}

void gsm_disable_voltage()
{
  platform_pio_op(ENABLE_PORT, ENABLE_PIN, PLATFORM_IO_PIN_CLEAR);
}

void gsm_toggle_power_pin()
{
  platform_pio_op(POWER_PORT, POWER_PIN, PLATFORM_IO_PIN_CLEAR);
  delay_ms(2000);
  platform_pio_op(POWER_PORT, POWER_PIN, PLATFORM_IO_PIN_SET);
}

/* Send *really* slow. Add inter character delays */
static void slow_send(const char *line) {
  while(*line) {
      platform_s_uart_send(GSM_UART_ID, *line);
    delay_ms(10);		/* inter-char delay */
     if ('\r' == *line)
       delay_ms(100);		/* Inter line delay */
     line++;
  }
}

void gsm_uart_write(const char *line)
{
  if (!gsm.flags&HW_FLOW_ENABLED)
    return slow_send(line);

  while(*line) {
    platform_s_uart_send(GSM_UART_ID, *line);
    line++;
  }
}

void gsm_uart_write_fmt(const char *fmt, ...)
{
  char cmd[256];
  va_list ap;
  va_start( ap, fmt );
  vsnprintf( cmd, 256, fmt, ap );
  va_end( ap );
  gsm_uart_write(cmd);
}

/* Find message matching current line */
static Message *lookup_urc_message(const char *line)
{
  int n;
  for(n=0; urc_messages[n].msg; n++) {
    if (0 == strncmp(line, urc_messages[n].msg, strlen(urc_messages[n].msg))) {
      return &urc_messages[n];
    }
  }
  return NULL;
}

/**
 * GSM command and state machine handler.
 * Receives lines from Simcom serial interfaces and parses them.
 */
void gsm_line_received()
{
  Message *m;
  char buf[BUFF_SIZE];
  int c,i=0;

  /* Dont mess with patterns */
  if (gsm_is_raw_mode())
    return;

  while('\n' != (c=platform_s_uart_recv(GSM_UART_ID,0))) {
    if (-1 == c)
      break;
    if ('\r' == c)
      continue;
    buf[i++] = (char)c;
    if(i==BUFF_SIZE)
      break;
  }
  buf[i] = 0;
  /* Skip empty lines */
  if (0 == i)
    return;
  if (0 == strcmp(GSM_CMD_LINE_END, buf))
    return;

