ruuvi/ruuvitracker_fw/src/platform/stm32f4/gsm.c
static int gsm_http_init(const char *url)
{
  int ret;
  char url_cmd[256];

  gsm_gprs_enable();

  snprintf(url_cmd, 256, "AT+HTTPPARA=\"URL\",\"%s\"", url);
  ret = gsm_cmd("AT+HTTPINIT");
  if (ret != AT_OK)
    return -1;
  ret = gsm_cmd("AT+HTTPPARA=\"CID\",\"1\"");
  if (ret != AT_OK)
    return -1;
  ret = gsm_cmd(url_cmd);
  if (ret != AT_OK)
    return -1;
  ret = gsm_cmd("AT+HTTPPARA=\"UA\",\"RuuviTracker/SIM908\"");
  if (ret != AT_OK)
    return -1;
  ret = gsm_cmd("AT+HTTPPARA=\"REDIR\",\"1\"");
  if (ret != AT_OK)
    return -1;
  return 0;
}

static int gsm_http_send_content_type(const char *content_type)
{
  char cmd[256];
  snprintf(cmd,256,"AT+HTTPPARA=\"CONTENT\",\"%s\"", content_type);
  if (gsm_cmd(cmd) != AT_OK)
    return -1;
  return 0;
}

static int gsm_http_send_data(const char *data)
{
  char cmd[256];
  snprintf(cmd, 256, "AT+HTTPDATA=%d,1000" GSM_CMD_LINE_END, strlen(data));
  gsm_uart_write(cmd);
  if (gsm_wait("DOWNLOAD", TIMEOUT_MS, NULL) == AT_TIMEOUT) {
    gsm.reply = AT_TIMEOUT;
    return -1;
  }
  gsm_uart_write(data);
  if (gsm_cmd(GSM_CMD_LINE_END) != AT_OK)  /* Send empty command to wait for OK */
    return -1;
  return 0;
}

static int gsm_http_handle(lua_State *L, method_t method,
                    const char *data, const char *content_type)
{
  int i,status,len,ret;
  char resp[64];
  const char *url = luaL_checkstring(L, 1);
  const char *p,*httpread_pattern = "+HTTPREAD";
  char *buf=0;
  char c;

  if (gsm_http_init(url) != 0) {
    printf("GSM: Failed to initialize HTTP\n");
    goto HTTP_END;
  }

  if (content_type) {
    if (gsm_http_send_content_type(content_type) != 0) {
      printf("GSM: Failed to set content type\n");
      goto HTTP_END;
    }
  }

  if (data) {
    if (gsm_http_send_data(data) != 0) {
      printf("GSM: Failed to send http data\n");
      goto HTTP_END;
    }
  }

  if (GET == method)
    ret = gsm_cmd("AT+HTTPACTION=0");
  else
    ret = gsm_cmd("AT+HTTPACTION=1");
  if (ret != AT_OK) {
    printf("GSM: HTTP Action failed\n");
    goto HTTP_END;
  }

  if (gsm_wait("+HTTPACTION", TIMEOUT_HTTP, resp) == AT_TIMEOUT) {
    printf("GSM: HTTP Timeout\n");
    goto HTTP_END;
  }

  if (2 != sscanf(resp, "+HTTPACTION:%*d,%d,%d", &status, &len)) { /* +HTTPACTION:<method>,<result>,<lenght of data> */
    printf("GSM: Failed to parse response\n");
    goto HTTP_END;
  }

  /* Read response, if there is any */
  if (len < 0)
    goto HTTP_END;

  if (NULL == (buf = malloc(len))) {
    printf("GSM: Out of memory\n");
    goto HTTP_END;
  }
  
  //Now read all bytes. block others from reading.
  gsm_set_raw_mode();
  gsm_uart_write("AT+HTTPREAD" GSM_CMD_LINE_END); //Wait for header
  p = httpread_pattern;
  while(*p) {           /* Wait for "+HTTPREAD:<data_len>" */
    c = platform_s_uart_recv(GSM_UART_ID, PLATFORM_TIMER_INF_TIMEOUT);
    if (c == *p) { //Match
      p++;
    } else { //No match, go back to start
      p = httpread_pattern;
    }
  }
  while ('\n' != platform_s_uart_recv(GSM_UART_ID, PLATFORM_TIMER_INF_TIMEOUT))
    ;;                          /* Wait end of line */
  /* Rest of bytes are data */
  for(i=0;i<len;i++) {
    buf[i] = platform_s_uart_recv(GSM_UART_ID, PLATFORM_TIMER_INF_TIMEOUT);
  }
  buf[i]=0;
  gsm_disable_raw_mode();

HTTP_END:
  gsm_cmd("AT+HTTPTERM");

  /* Create response structure */
  lua_newtable(L);
  lua_pushstring(L, "status");
  lua_pushinteger(L, status);
  lua_settable(L, -3);
  if (buf) {
    lua_pushstring(L, "content");
    lua_pushstring(L, buf);
    lua_settable(L, -3);
  }
  lua_pushstring(L, "is_success" );
  lua_pushboolean(L, ((200 <= status) && (status < 300))); /* If HTTP response was 2xx */
  lua_settable(L, -3);
  return 1;
}

static int gsm_http_get(lua_State *L)
{
  return gsm_http_handle(L, GET, NULL, NULL);
}

static int gsm_http_post(lua_State *L)
{
  const char *data = luaL_checkstring(L, 2); /* 1 is url, it is handled in http_handle function */
  const char *content_type = luaL_checkstring(L, 3);
  return gsm_http_handle(L, POST, data, content_type);
}


/* TCP FUNCTIONS */

typedef struct socket {
  int con;
  enum {CONNECTED, DISCONNECTED} state;
} socket;

/* Initialize GSM metatable */
static void gsm_tcp_initialize_meta(lua_State *L)
{
  int index;
  if(0 == luaL_newmetatable(L, "socket_meta")) /* Create our metatable */
    return;                                    /* Already created. */
  index = lua_gettop(L);
  lua_getglobal(L, "gsm");      /* Get gsm.socket to top */
  lua_pushstring(L, "socket");
  lua_gettable(L, -2);
  lua_setfield(L, index, "__index"); /* socket_meta.__index = gsm.socket */
}

static int gsm_tcp_enable()
{
  int rc = 0;
  while(gsm.state < STATE_READY)
    delay_ms(100);

  if (gsm.flags&TCP_ENABLED)
    return 0;

  rc = gsm_cmd("AT+CIPMUX=1");  /* Multi IP */
  rc = gsm_cmd("AT+CIPSPRT=1"); /* Report '>' */
  rc = gsm_cmd("AT+CGATT?");
  rc = gsm_cmd_fmt("AT+CSTT=\"%s\"", gsm.ap_name);
  rc = gsm_cmd("AT+CIICR");
  gsm_cmd("AT+CIFSR"); //This does not respond 'OK' but is required to change state
  if (!rc)
    gsm.flags |= TCP_ENABLED;
  return rc;
}

enum MODE { TCP, UDP };
static int gsm_tcp_connect(lua_State *L)
{
  int rc,con;
  int mode = TCP;
  static int next_connection_number=0;

  const char *addr = luaL_checkstring(L,1);
  const int port = luaL_checkinteger(L,2);
  if (3 == lua_gettop(L))
    mode = luaL_checkinteger(L, 3);

  gsm_tcp_initialize_meta(L);

  if (AT_OK != gsm_tcp_enable()) {
    return luaL_error(L, "Cannot enable GPRS PDP\n");
  }
  con = (next_connection_number++)%8;
  /* Connect */
  rc = gsm_cmd_fmt("AT+CIPSTART=%d,\"%s\",\"%s\",%d",con,(TCP==mode)?"TCP":"UDP", addr, port);
  rc = gsm_wait("CONNECT OK", 2*TIMEOUT_HTTP, NULL);
  if (AT_OK != rc) {
    printf("Connection failed\n");
    return 0;
  }

  /* Create Socket object */
  socket *s = (socket*) lua_newuserdata(L, sizeof(socket));
  luaL_getmetatable(L, "socket_meta");
  lua_setmetatable(L, -2);

  printf("Connected\n");
  s->con = con;
  s->state = CONNECTED;
  return 1; // lua_newuserdata pushed alredy to stack
}

typedef struct receive_buf r_buf;
struct receive_buf {
  r_buf *next;
  char data[0];
};
r_buf *receive_buf[8]; //8 connections;

